//#pragma once

////=================================================================================
//// Описание сервера
//#include "search_server.h"
//// Hand-made фреймворк для юнит-тестов
//#include "asserts.h"

////=================================================================================
////Добавление документов. Добавленный документ должен находиться по поисковому запросу, который содержит слова из документа.
//void TestAddDocumentAndFindAddedDocument();

////=================================================================================
////Поддержка стоп-слов. Стоп-слова исключаются из текста документов.
//void TestExcludeStopWordsFromDocument();

////=================================================================================
////Поддержка минус-слов. Документы, содержащие минус-слова поискового запроса, не должны включаться в результаты поиска.
//void TestMinusWordsSupport();

////=================================================================================
////Матчинг документов. При матчинге документа по поисковому запросу должны быть возвращены все слова из поискового запроса, присутствующие в документе.
////Если есть соответствие хотя бы по одному минус-слову, должен возвращаться пустой список слов.
//void TestMatchDocument();

////=================================================================================
////Сортировка найденных документов по релевантности. Возвращаемые при поиске документов результаты должны быть отсортированы в порядке убывания релевантности.
//void TestSortSocumentsByRelevance();

////=================================================================================
////Вычисление рейтинга документов. Рейтинг добавленного документа равен среднему арифметическому оценок документа.
//void TestDocumentRatingCalculation();

////=================================================================================
////Фильтрация результатов поиска с использованием предиката, задаваемого пользователем.
//void TestDocumentFiltrationWithPredicate();

////=================================================================================
////Поиск документов, имеющих заданный статус.
//void TestDocumentWithGivenStatus();

////=================================================================================
////Корректное вычисление релевантности найденных документов.
//void TestCorectDocumentRelevanceCalculation();

////=================================================================================
//// Тест проверяет, что поисковая система исключает стоп-слова при добавлении документов
//void TestExcludeStopWordsFromAddedDocumentContent();

////=================================================================================
//// Тест проверяет количество документов на сервере
//void TestDocumentsCount();
